wyniki_10G_article/fio_results_ext4_nvme/block_size_1024/lab-sec-15/fio_seq_write_article_test_output.txt
seq_write_article_test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_write_article_test: Laying out IO file (1 file / 10240MiB)

seq_write_article_test: (groupid=0, jobs=1): err= 0: pid=59330: Sun Apr 20 14:35:25 2025
  write: IOPS=18.1k, BW=70.7MiB/s (74.1MB/s)(12.4GiB/180001msec); 0 zone resets
    slat (usec): min=3, max=138660, avg= 8.21, stdev=77.50
    clat (usec): min=17, max=134600, avg=45.59, stdev=327.11
     lat (usec): min=27, max=157139, avg=53.81, stdev=338.79
    clat percentiles (usec):
     |  1.00th=[   32],  5.00th=[   33], 10.00th=[   34], 20.00th=[   35],
     | 30.00th=[   36], 40.00th=[   36], 50.00th=[   37], 60.00th=[   37],
     | 70.00th=[   38], 80.00th=[   39], 90.00th=[   41], 95.00th=[   44],
     | 99.00th=[   59], 99.50th=[  105], 99.90th=[ 2671], 99.95th=[ 4883],
     | 99.99th=[13960]
   bw (  KiB/s): min=   56, max=98448, per=100.00%, avg=72369.64, stdev=16290.89, samples=359
   iops        : min=   14, max=24612, avg=18092.41, stdev=4072.74, samples=359
  lat (usec)   : 20=0.01%, 50=97.83%, 100=1.55%, 250=0.40%, 500=0.04%
  lat (usec)   : 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.09%, 10=0.04%, 20=0.02%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=5.71%, sys=17.89%, ctx=3256396, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3256374,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=70.7MiB/s (74.1MB/s), 70.7MiB/s-70.7MiB/s (74.1MB/s-74.1MB/s), io=12.4GiB (13.3GB), run=180001-180001msec

Disk stats (read/write):
  nvme0n1: ios=0/3256760, sectors=0/26184808, merge=0/3279, ticks=0/339866, in_queue=339947, util=68.59%